tusharmali017/PIC24_Peripherals/UARTTx.X/main.c

// PIC24FJ1024GB610 Configuration Bit Settings

// 'C' source line config statements

// FSEC
#pragma config BWRP = OFF               // Boot Segment Write-Protect bit (Boot Segment may be written)
#pragma config BSS = DISABLED           // Boot Segment Code-Protect Level bits (No Protection (other than BWRP))
#pragma config BSEN = OFF               // Boot Segment Control bit (No Boot Segment)
#pragma config GWRP = OFF               // General Segment Write-Protect bit (General Segment may be written)
#pragma config GSS = DISABLED           // General Segment Code-Protect Level bits (No Protection (other than GWRP))
#pragma config CWRP = OFF               // Configuration Segment Write-Protect bit (Configuration Segment may be written)
#pragma config CSS = DISABLED           // Configuration Segment Code-Protect Level bits (No Protection (other than CWRP))
#pragma config AIVTDIS = OFF            // Alternate Interrupt Vector Table bit (Disabled AIVT)

// FBSLIM
#pragma config BSLIM = 0x1FFF           // Boot Segment Flash Page Address Limit bits (Enter Hexadecimal value)

// FOSCSEL
#pragma config FNOSC = PRI              // Oscillator Source Selection (Primary Oscillator (XT, HS, EC))
#pragma config PLLMODE = DISABLED       // PLL Mode Selection (No PLL used; PLLEN bit is not available)
#pragma config IESO = ON                // Two-speed Oscillator Start-up Enable bit (Start up device with FRC, then switch to user-selected oscillator source)

// FOSC
#pragma config POSCMD = XT              // Primary Oscillator Mode Select bits (XT Crystal Oscillator Mode)
#pragma config OSCIOFCN = OFF           // OSC2 Pin Function bit (OSC2 is clock output)
#pragma config SOSCSEL = ON             // SOSC Power Selection Configuration bits (SOSC is used in crystal (SOSCI/SOSCO) mode)
#pragma config PLLSS = PLL_PRI          // PLL Secondary Selection Configuration bit (PLL is fed by the Primary oscillator)
#pragma config IOL1WAY = ON             // Peripheral pin select configuration bit (Allow only one reconfiguration)
#pragma config FCKSM = CSDCMD           // Clock Switching Mode bits (Both Clock switching and Fail-safe Clock Monitor are disabled)

// FWDT
#pragma config WDTPS = PS32768          // Watchdog Timer Postscaler bits (1:32,768)
#pragma config FWPSA = PR128            // Watchdog Timer Prescaler bit (1:128)
#pragma config FWDTEN = ON              // Watchdog Timer Enable bits (WDT Enabled)
#pragma config WINDIS = OFF             // Watchdog Timer Window Enable bit (Watchdog Timer in Non-Window mode)
#pragma config WDTWIN = WIN25           // Watchdog Timer Window Select bits (WDT Window is 25% of WDT period)
#pragma config WDTCMX = WDTCLK          // WDT MUX Source Select bits (WDT clock source is determined by the WDTCLK Configuration bits)
#pragma config WDTCLK = LPRC            // WDT Clock Source Select bits (WDT uses LPRC)

// FPOR
#pragma config BOREN = ON               // Brown Out Enable bit (Brown Out Enable Bit)
#pragma config LPCFG = OFF              // Low power regulator control (No Retention Sleep)
#pragma config DNVPEN = ENABLE          // Downside Voltage Protection Enable bit (Downside protection enabled using ZPBOR when BOR is inactive)

// FICD
#pragma config ICS = PGD2               // ICD Communication Channel Select bits (Communicate on PGEC2 and PGED2)
#pragma config JTAGEN = OFF             // JTAG Enable bit (JTAG is disabled)
#pragma config BTSWP = OFF              // BOOTSWP Disable (BOOTSWP instruction disabled)

// FDEVOPT1
#pragma config ALTCMPI = DISABLE        // Alternate Comparator Input Enable bit (C1INC, C2INC, and C3INC are on their standard pin locations)
#pragma config TMPRPIN = OFF            // Tamper Pin Enable bit (TMPRN pin function is disabled)
#pragma config SOSCHP = ON              // SOSC High Power Enable bit (valid only when SOSCSEL = 1 (Enable SOSC high power mode (default))
#pragma config ALTVREF = ALTREFEN       // Alternate Voltage Reference Location Enable bit (VREF+ and CVREF+ on RA10, VREF- and CVREF- on RA9)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>


uint16_t temp;

void setpinmap()
{
    __builtin_write_OSCCONL(OSCCON & 0xbf);
    // Configure Input Functions 
    RPINR18bits.U1RXR = 10; // Assign U1RXR to RP10
    
    // Configure Output Functions
    RPOR8bits.RP17R = 3; //Assign U1TX To Pin RP17
    __builtin_write_OSCCONL(OSCCON | 0x40);
}

void UARTInit()
{
    U1BRG = 25;                 //9600 baud rate set into baud rate register
    /*
     * Desired Baud Rate = Fcy/16(UxBRG+1)
     * UxBRG= ((Fcy/Baud rate)/16)-1
     * U1BRG = ((4MHz/9600)/16)-1
     * U1BRG = 25           //BRGH = 0,  allows for greater accuracy in baud rate generation
     *                      for low baud rates, recommended to use BRGH = 0
    */
       
    U1MODE = 0x8000;               //UART enabled
    U1STA = 0;                     //UART1 status and control register
    
    U1STAbits.UTXEN = 1;         //Enable Transmission
    U1STAbits.URXEN = 1;        //Enable Receiver
    
//    // Configure UART1 RX Interrupt
//    _U1RXIF = 0; // Clear UART1 RX Interrupt Flag
//    _U1RXIE = 0; // Enable UART1 RX Interrupt
}

void UARTWrite(int data)
{
  while (U1STAbits.UTXBF); // Wait until the transmit buffer is empty
  U1TXREG = data;          // Write the data to the UART1 transmit register
}


void UARTPutString(char *tx_str, int size)
{
    unsigned int i;
    for(i=0; i<size; i++)
    {
        UARTWrite(*tx_str);
        tx_str++;
    }
}

int main(void) {
    setpinmap();
    UARTInit();
    while(1)
    {
        //UARTWrite('A');
        UARTPutString("Hello Everyone\r\n", 16);   
    }
    return 0;
}
